// Найти расстояние между точками в пространстве 2D/3D


int a = new Random().Next(10, 21);
Console.Write(a);

Console.WriteLine("Ввеите число, на которое нужно проверить кратность выбранного числа: ");
int b = int.Parse(Console.ReadLine());